{
  "transcriptScenarios": [
    {
      "id": "scenario-001",
      "title": "Credit Card Recurring Charges",
      "category": "Credit Cards",
      "messages": [
        {
          "id": "msg-1",
          "timestamp": "5 minutes ago",
          "speaker": "customer",
          "text": "Hi, I'm seeing multiple charges on my credit card that I don't recognize. They appear to be recurring transactions."
        },
        {
          "id": "msg-2",
          "timestamp": "4 minutes ago",
          "speaker": "agent",
          "text": "I understand your concern about the unrecognized recurring charges on your credit card. I'd be happy to help you investigate these transactions. Can you tell me the merchant names or amounts?"
        },
        {
          "id": "msg-3",
          "timestamp": "3 minutes ago",
          "speaker": "customer",
          "text": "Yes, I see charges from 'STREAMCO PREMIUM' for £12.99 and 'FITCLUB MONTHLY' for £39.99. These have been coming out every month."
        },
        {
          "id": "msg-4",
          "timestamp": "2 minutes ago",
          "speaker": "agent",
          "text": "Thank you for providing those details. I can see both subscriptions on your account. STREAMCO PREMIUM is a streaming service subscription, and FITCLUB MONTHLY appears to be a gym membership. Would you like to cancel either or both of these?"
        },
        {
          "id": "msg-5",
          "timestamp": "1 minute ago",
          "speaker": "customer",
          "text": "I definitely want to cancel the FITCLUB one - I haven't been to the gym in months. Can you help me with that?"
        }
      ]
    },
    {
      "id": "scenario-002",
      "title": "Account Upgrade Request",
      "category": "Account Management",
      "messages": [
        {
          "id": "msg-1",
          "timestamp": "3 minutes ago",
          "speaker": "customer",
          "text": "I've been a customer for several years and I'm interested in upgrading my account to Premier status. What are the requirements?"
        },
        {
          "id": "msg-2",
          "timestamp": "2 minutes ago",
          "speaker": "agent",
          "text": "I'd be happy to help you with your account upgrade. For Premier status, you'll need a minimum monthly income of £75,000 or total relationship balance of £250,000. Let me check your current eligibility."
        },
        {
          "id": "msg-3",
          "timestamp": "1 minute ago",
          "speaker": "customer",
          "text": "That sounds reasonable. I believe I meet the income requirements. What additional benefits would I get with Premier?"
        }
      ]
    },
    {
      "id": "scenario-003",
      "title": "International Transfer Query",
      "category": "International Banking",
      "messages": [
        {
          "id": "msg-1",
          "timestamp": "4 minutes ago",
          "speaker": "customer",
          "text": "I need to send money to my daughter who's studying abroad in Australia. What are the fees and how long will it take?"
        },
        {
          "id": "msg-2",
          "timestamp": "3 minutes ago",
          "speaker": "agent",
          "text": "I can help you with that international transfer. For Australia, our standard transfer fee is £15 for amounts up to £10,000, and transfers typically arrive within 1-2 business days. How much are you looking to send?"
        },
        {
          "id": "msg-3",
          "timestamp": "2 minutes ago",
          "speaker": "customer",
          "text": "I need to send about £2,500 for her university fees. Is there a better exchange rate if I send a larger amount?"
        }
      ]
    }
  ],
  "messageTemplates": {
    "greetings": [
      "Hello, how can I help you today?",
      "Good morning, what can I assist you with?",
      "Hi there, I'm here to help with any banking questions you have."
    ],
    "clarifications": [
      "Could you provide more details about that?",
      "Let me make sure I understand correctly...",
      "Can you clarify what you mean by...?"
    ],
    "confirmations": [
      "I've completed that request for you.",
      "That's all taken care of now.",
      "I've processed that change to your account."
    ],
    "closings": [
      "Is there anything else I can help you with today?",
      "Thank you for calling HSBC Bank, have a great day!",
      "If you need any further assistance, please don't hesitate to call us."
    ]
  }
}
